Repository: ArrayAccess/TrayDigita
Catalog: src/Lang/*.po
Languages: id

# console
source: List or run scheduler.
id: Daftar atau jalankan penjadwal.

# console
source: Run the pending schedulers
id: Jalankan penjadwal yang tertunda

# console
source: The %s help you to list & run scheduler
id: %s membantu anda untuk membuat daftar & menjalankan penjadwal

# console
source: Object scheduler is not valid
id: Object penjadwal tidak sah

# console
source: Name
id: Nama

# console
source: Last Execution
id: Eksekusi Terakhir

# console
source: Execution Time
id: Waktu Eksekusi

# console
source: Waiting
id: Menunggu

# console
source: No Schedulers Waiting For Execution
id: Tidak Ada Penjadwal yang Menunggu Eksekusi

# console
source: Are you sure to execute scheduler ?
id: Apakah Anda yakin untuk menjalankan penjadwal?

# console
source: Success
id: Berhasil

# console
source: Exited
id: Keluar

# console
source: Stopped
id: Dihentikan

# console
source: Failure
id: Kegagalan

# console
source: Skipped
id: Dilewati

# console
source: Next Run Date
id: Tanggal Pengoperasian Berikutnya

# console
source: Need To Execute
id: Perlu Dieksekusi

# console
source: Finished
id: Diselesaikan

# console
source: No Schedulers Registered
id: Tidak Ada Penjadwal Terdaftar

# console
source: Using Timezone
id: Menggunakan Zona Waktu

# console
source: Timezone Offset
id: Pengimbangan Zona Waktu

# console
source: Generate scheduler class.
id: Hasilkan kelas penjadwal.

# console
source: The %s help you to create %s object. Scheduler will use prefix namespace with %s Scheduler only support single class name.
id: %s membantu Anda membuat objek %s. Penjadwal akan menggunakan awalan namespace dengan %s Penjadwal hanya mendukung nama kelas tunggal.

# console
source: Please enter scheduler class name
id: Mohon masukkan nama kelas penjadwal

# console
source: Please enter valid scheduler class name!
id: Mohon masukkan nama kelas penjadwal yang sah!

# console
source: Scheduler [%s] is invalid! class name contain reserved keyword!
id: Penjadwal [%s] tidak valid! nama kelas berisi kata kunci bawaan!

# console
source: Scheduler [%s] is invalid! Scheduler only contain single class name, not namespaced!
id: Penjadwal [%s] tidak sah! Penjadwal hanya boleh berupa nama kelas tunggal, bukan bermuatan namespace!

# console
source: Scheduler [%s] is too long! Must be less or equal 128 characters
id: Penjadwal [%s] terlalu panjang! Harus kurang dari atau sama dengan 128 karakter

# console
source: Scheduler [%s] exist
id: Penjadwal [%s] tersedia

# console
source: %s Could not detect scheduler directory
id: %s Tidak dapat mendeteksi direktori penjadwal

# console
source: Scheduler Name : %s
id: Nama Penjadwal : %s

# console
source: Scheduler Identity : %s
id: Identitas Penjadwal : %s

# console
source: Scheduler Class : %s
id: Kelas Penjadwal : %s

# console
source: Scheduler File : %s
id: Berkas Penjadwal : %s

# console
source: %s Could not save scheduler!
id: %s Tidak dapat menyimpan penjadwal!

# console
source: %s Scheduler successfully created!
id: %s Scheduler berhasil dibuat!

# console
source: Time %s secs; Memory Usage: %s; Memory Peak Usage: %s
id: Waktu %s detik; Penggunaan Memori: %s; Penggunaan Puncak Memori: %s

# scheduler
source: Callback task must be contain return type or instance of: %s
id: Callback harus berupa tipe pengembalian atau instance dari: %s

# scheduler
source: Scheduler is on progress with (%s) task remaining
id: Penjadwal sedang berlangsung dengan (%s) tugas tersisa

# template
source: version
id: versi

# template
source: unknown
id: tak diketahui

# chunk-uploader
source: Storage directory could not be empty or whitespace only.
id: Direktori penyimpanan tidak dapat kosong atau berupa whitespace saja.

# chunk-uploader
source: Directory %s is not exist
id: Direktori %s tidak ada

# chunk-uploader
source: Directory %s is not writable
id: Direktori %s tidak dapat ditulisi

# chunk-uploader
source: Request id "%s" is not valid
id: Request id "%s" tidak sah

# chunk-uploader
source: Cache upload storage is not writable.
id: Direktori penyimpanan cache tidak dapat ditulisi.

# chunk-uploader
source: Upload cache file is not writable.
id: Berkas cache unggahan tidak dapat ditulisi.

# chunk-uploader
source: Can not create cached stream.
id: Tidak dapat membuat cached stream.

# chunk-uploader
source: Cache file has been locked.
id: Berkas cache terkunci.

# chunk-uploader
source: Offset upload position is invalid.
id: Posisi offset unggahan tidak sah.

# chunk-uploader
source: Source uploaded file does not exist.
id: Berkas sumber yang diunggah tidak ada.

# chunk-uploader
source: Upload cache file is not ready to move : (%d).
id: Berkas cache yang diunggah belum siap dipindahkan : (%d).

# chunk-uploader
source: Target file "%s" is not writable.
id: Berkas tujuan "%s" tidak dapat ditulisi.

# chunk-uploader
source: Target directory "%s" is not writable.
id: Direktori tujuan "%s" tidak dapat ditulisi.

# chunk-uploader
source: Uploaded files does not contain file name.
id: Berkas terunggah tidak mempunyai nama berkas.

# chunk-uploader
source: Content-Range "%s" is invalid
id: Content-Range "%s" tidak sah

# chunk-uploader
source: Content-Range unit "%s" is invalid
id: Unit Content-Range "%s" tidak sah

# chunk-uploader
source: System does not support unknown size
id: Sistem tidak mendukung ukuran yang tidak diketahui

# chunk-uploader
source: Uploaded file size is bigger than allowed size: %s.
id: Ukuran berkas yang diunggah lebih besar dari ukuran yang diperbolehkan: %s.

# chunk-uploader
source: Uploaded file size range is less than allowed minimum size: %s.
id: Ukuran rentang berkas yang diunggah kurang dari ukuran minimum yang diperbolehkan: %s.

# chunk-uploader
source: Content-Range start bytes must be zero without Request-Id.
id: Content-Range byte awal harus nol atau tanpa Request-Id.

# chunk-uploader
source: Content-Range start bytes must be greater zero with Request-Id.
id: Content-Range awal harus lebih besar dari nol dengan Id Permintaan.

# chunk-uploader
source: Uploaded file size is bigger than ending size.
id: Ukuran berkas yang diunggah lebih besar dari ukuran akhir.

# chunk-uploader
source: Range size is bigger than file size.
id: Ukuran rentang lebih besar dari ukuran berkas.
