Repository: ArrayAccess/TrayDigita
Catalog: src/Lang/*.po
Languages: id

# benchmark
source: Database
id: Basis Data

# benchmark
source: Event
id: Acara

# benchmark
source: Service
id: Layanan

# benchmark
source: rendered time
id: waktu pemuatan

# benchmark
source: memory usage
id: penggunaan memori

# benchmark
source: peak memory usage
id: penggunaan puncak memori

# benchmark
source: Memory
id: Memori

# benchmark
source: Memory usage
id: Penggunaan memori

# benchmark
source: Real memory usage
id: Pengginaan memori asli

# benchmark
source: Peak memory usage
id: Penggunaan puncak memori

# benchmark
source: Real Peak memory usage
id: Penggunaan Puncak Memori sebenarnya

# benchmark
source: Benchmark memory usage
id: Penggunaan Memori Benchmark

# benchmark
source: Duration
id: Durasi

# benchmark
source: Total duration
id: Total durasi

# benchmark
source: Benchmark duration
id: Durasi benchmark

# benchmark
source: Application rendering duration
id: Durasi pemuatan aplikasi

# benchmark
source: Filter
id: Saring

# benchmark
source: NO BENCHMARKS
id: TIDAK ADA BENCHMARK

# benchmark
source: Total Groups: %d
id: Total Grup: %d

# benchmark
source: Group : %s
id: Grup : %s

# benchmark
source: Group
id: Grup

# benchmark
source: Total Memory: %s
id: Total Memori: %s

# benchmark
source: Total Benchmarks Duration: %s
id: Total Durasi Benchmark: %s

# console
source: Check & validate application.
id: Periksa & validasi aplikasi.

# console
source: The %s help you to validate application. This command show information about installed application services.
id: %s membantu Anda memvalidasi aplikasi. Perintah ini menampilkan informasi tentang layanan aplikasi yang terinstall.

# console
source: Application Check
id: Pemeriksa Aplikasi

# console
source: Can not get cache object from container
id: Tidak bisa mendapatkan objek cache dari container

# console
source: Cache is not valid object from container
id: Objek cache tidak valid dari container

# console
source: Cache object error
id: Objek cache bermasalah

# console
source: Error:
id: Kesalahan:

# console
source: Unknown Error
id: Kesalahan yang tidak diketahui

# console
source: Cache object is set [%s]
id: Objek cache telah ditentukan [%s]

# console
source: Adapter
id: Adaptor

# console
source: Default Lifetime
id: Lifetime Bawaan

# console
source: Config environment is not set
id: Environmen konfig belum ditentukan

# console
source: Debugging - error display [%s]
id: Debugging - tampilan kesalahan [%s]

# console
source: Enabled
id: Diaktifkan

# console
source: Disabled
id: Dinonaktifkan

# console
source: Benchmark profiling [%s]
id: Profiling benchmark [%s]

# console
source: Benchmarks records (%d)
id: Rekaman benchmark (%d)

# console
source: Benchmarks group
id: Grup benchmark

# console
source: App directory is not exists
id: Direktori App tidak ada

# console
source: Required Applications directory
id: Direktori Aplikasi yang diperlukan

# console
source: Storage directory is not writable
id: Direktori penyimpanan tidak dapat ditulisi

# console
source: directory
id: direktori

# console
source: Configuration file is not a valid file (%s)
id: Berkas konfigurasi bukan berkas yang sah (%s)

# console
source: Configuration file is invalid (%s)
id: Berkas konfigurasi tidak sah (%s)

# console
source: Configuration file is empty (%s)
id: Berkas konfigurasi kosong (%s)

# console
source: Configuration file does not exists (%s)
id: Berkas konfigurasi tidak tersedia (%s)

# console
source: Configuration
id: Konfigurasi

# console
source: Configuration file is not exists on container
id: Berkas konfigurasi tidak tersedia di container

# console
source: Configuration file does not contain database configuration
id: Berkas konfigurasi tidak berisi konfigurasi basis data

# console
source: Configuration file does not contain valid database configuration
id: Berkas konfigurasi tidak berisi konfigurasi basis data yang sah

# console
source: Configuration file does not contain security configuration
id: Berkas konfigurasi tidak terdapat konfigurasi keamanan

# console
source: Configuration file does not contain valid security configuration
id: Berkas konfigurasi tidak berisi konfigurasi keamanan yang sah

# console
source: Configuration file is exist & valid
id: Berkas konfigurasi tersedia & sah

# console
source: Container object not set
id: Object Container belum ditentukan

# console
source: Container object is set [%s]
id: Objek Container telah ditentukan [%s]

# console
source: Registered Container (%d)
id: Container Terdaftar (%d)

# console
source: Registered Aliases (%d)
id: Alias ​​Terdaftar (%d)

# console
source: Php version
id: Versi Php

# console
source: extension is not exist
id: ekstensi tidak tersedia

# console
source: extension valid
id: ekstensi sah

# console
source: with version
id: dengan versi

# console
source: All required extensions are installed
id: Semua ekstensi yang diperlukan telah terpasang

# console
source: required extensions is not installed
id: ekstensi yang diperlukan belum terpasang

# console
source: extension installed
id: ekstensi terinstall

# console
source: No recommended extensions installed
id: Tidak ada rekomendasi ekstensi yang terpasang

# console
source: recommended extension installed
id: rekomendasi ekstensi yang terpasang

# console
source: Can not get translator object from container
id: Tidak bisa mendapatkan objek penerjemah dari container

# console
source: Translator is not valid object from container
id: Penerjemah tidak valid dari container

# console
source: Translator object is set
id: Object penerjemah tidak ditentukan

# console
source: No Adapter Registered
id: Tidak Ada Adaptor Terdaftar

# console
source: Registered Adapters (%d)
id: Adaptor Terdaftar (%d)

# console
source: Current Language
id: Bahasa Saat Ini

# console
source: Create temporary php builtin web server.
id: Buat server web sementara bawaan php.

# console
source: Port number that used for listening server
id: Nomor port yang digunakan untuk server

# console
source: Host that used to listening server.
id: Host yang digunakan untuk server.

# console
source: Public index.php file.
id: Berkas public index.php.

# console
source: The %s help you to create temporary php builtin web server like: %s You can use %s Host accept local %s Port accept range between %s
id: %s Membantu anda untuk membuat php builtin web server sementara seperti: %s Anda dapat menggunakan %s Menerima host local %s Menerima port antara %s

# console
source: port number
id: nomor port

# console
source: Command %s Error!
id: Perintah %s Bermasalah!

# console
source: Port is Invalid! option port must be numeric.
id: Port Tidak Sah! opsi port harus berupa angka.

# console
source: Port is Invalid! option port should not use: %s
id: Port Tidak Sah! opsi port tidak boleh menggunakan: %s

# console
source: Typically this port used by %s application.
id: Biasanya port ini digunakan oleh aplikasi %s.

# console
source: Port is out of range! option port must be between: %s to %s
id: Port berada di luar jangkauan! opsi port harus antara: %s hingga %s

# console
source: Option host is invalid. Host only accept "localhost" and local IP address.
id: Opsi host tidak sah. Host hanya menerima “localhost” dan alamat IP lokal.

# console
source: Option host is invalid. IP %s is not a local IP address.
id: Opsi host tidak sah. IP %s bukan merupakan alamat IP lokal.

# console
source: Could not detect public root file.
id: Tidak dapat mendeteksi berkas root publik.

# console
source: Public root file is not in application directory!
id: Berkas root publik tidak berada pada direktori aplikasi!

# console
source: Could not detect php binary executable file.
id: Tidak dapat mendeteksi berkas binary executable php.

# console
source: Function [exec] is not exist
id: Fungsi [exec] tidak tersedia

# console
source: Checking
id: Memeriksa

# console
source: Can not determine port that can be used after doing %s tests
id: Tidak dapat menentukan port yang dapat digunakan setelah melakukan %s tes

# console
source: Can not listening %s with port %s
id: Tidak dapat memproses %s dengan port %s

# console
source: Press %s to exit.
id: Tekan %s untuk keluar.

# console
source: Create list of core file checksums.
id: Membuat berkas daftar inti ceksum.

# console
source: Display checksums on terminal without writing to disk
id: Tampilkan checksum di terminal tanpa menulis ke disk

# console
source: The %s creating checksum files on %s directory.
id: %s membuat berkas ceksum pada direktori %s.

# console
source: Files will be put in directory: %s
id: Berkas akan diletakkan pada direktori: %s

# console
source: Are you sure to continue (Yes/No)?
id: Apakah anda yakin ingin melanjutkan (Yes/No)?

# console
source: Please enter valid answer! (Yes / No)
id: Mohon masukkan jawaban yang benar! (Yes/No)

# console
source: Operation cancelled!
id: Operasi dibatalkan!

# console
source: Done!
id: Selesai!

# console
source: Source
id: Sumber

# console
source: Generate command class.
id: Hasilkan kelas perintah.

# console
source: Print generated class file only
id: Tampilkan berkas kelas yang dihasilkan saja

# console
source: The %s help you to create %s object. Command will use prefix namespace with %s Command only support single class name.
id: %s membantu Anda membuat objek %s. Perintah akan menggunakan awalan namespace dengan %s Perintah hanya mendukung nama kelas tunggal.

# console
source: Please enter command class name
id: Mohon masukkan nama kelas perintah

# console
source: Please enter valid command class name!
id: Mohon masukkan nama kelas perintah yang sah!

# console
source: Command [%s] is invalid! class name contain reserved keyword!
id: Perintah [%s] tidak sah! nama kelas berisi kata kunci bawaan!

# console
source: Command [%s] is invalid! Command only contain single class name, not namespaced!
id: Perintah [%s] tidak sah! Perintah hanya boleh berupa nama kelas tunggal, bukan berupa namsapace!

# console
source: Command [%s] is too long! Must be less or equal 128 characters
id: Perintah [%s] terlalu panjang! Harus kurang dari atau sama dengan 128 karakter

# console
source: Command [%s] exist
id: Perintah [%s] tersedia

# console
source: %s Could not detect command directory
id: %s Tidak dapat mendeteksi direktori perintah

# console
source: %s generator only support in interactive mode
id: Generator %s hanya mendukung mode interaktif

# console
source: Command Name : %s
id: Nama Perintah : %s

# console
source: Command Class : %s
id: Kelas Perintah : %s

# console
source: Command File : %s
id: Berkas Perintah : %s

# console
source: %s Could not save command!
id: %s Tidak dapat menyimpan perintah!

# console
source: %s Command successfully created!
id: %s Perintah berhasil dibuat!

# console
source: Generate controller class.
id: Hasilkan kelas pengontrol.

# console
source: The %s help you to create controller object. Controller will use prefix namespace with %s Character slash %s, hyphen %s and underscore %s Will converted into namespace separator
id: %s membantu Anda membuat objek pengontrol. Pengontrol akan menggunakan awalan namespace dengan %s Karakter garis miring %s, tanda hubung %s dan garis bawah %s Akan diubah menjadi pemisah namespace

# console
source: Please enter controller name
id: Mohon masukkan nama pengontrol

# console
source: Please enter valid controller name!
id: Silakan masukkan nama pengontrol yang sah!

# console
source: Controller [%s] is too long! Must be less or equal 5 namespaces
id: Pengontrol [%s] terlalu panjang! Harus kurang dari atau sama dengan 5 namespace

# console
source: Controller [%s] is invalid! class name contain reserved keyword!
id: Pengontrol [%s] tidak sah! nama kelas berisi kata kunci bawaan!

# console
source: Controller [%s] exist
id: Pengontrol [%s] tersedia

# console
source: %s Could not detect controller directory
id: %s Tidak dapat mendeteksi direktori pengontrol

# console
source: Controller Name : %s
id: Nama Pengontrol : %s

# console
source: Controller Class : %s
id: Kelas Pengontrol : %s

# console
source: Controller File : %s
id: Berkas Pengontrol : %s

# console
source: %s Could not save controller!
id: %s Tidak dapat menyimpan pengontrol!

# console
source: %s Controller successfully created!
id: %s Pengontrol berhasil dibuat!

# console
source: Check & validate database.
id: Periksa & validasi basis data.

# console
source: Validate changed / difference about database schema
id: Validasi perubahan / perbedaan tentang skema basis data

# console
source: Print sql query create schema (should execute with %s command)
id: Tampilkan kueri sql untuk pembuatan skema (seharusnya dijalankan dengan perintah %s)

# console
source: Dump create schema (should execute with %s & %s command)
id: Dump skema pembuatan (seharusnya dijalankan dengan perintah %s & %s)

# console
source: Execute query sql that from new schema into database (should execute with %s command)
id: Jalankan kueri sql yang dari skema baru ke dalam basis data (seharusnya dijalankan dengan perintah %s)

# console
source: Optimize database when possible (should execute with %s command)
id: Optimalkan basis data apabila memungkinkan (harus dijalankan dengan perintah %s)

# console
source: The %s help you to validate database. This command show information about installed database & configuration services.
id: %s membantu Anda memvalidasi database. Perintah ini menampilkan informasi tentang database yang terinstall & layanan konfigurasi.

# console
source: Can not get database object from container
id: Tidak bisa mendapatkan objek basis data dari container

# console
source: Database connection is not valid object from container
id: Koneksi basis data bukan objek yang valid dari container

# console
source: No schema can be created
id: Tidak ada skema yang bisa dibuat

# console
source: No change into database schema
id: Tidak ada perubahan pada skema basis data

# console
source: Table "%s" does not exist!
id: Tabel "%s" tidak ada!

# console
source: Table "%s" %s
id: Tabel "%s" %s

# console
source: no difference
id: tak ada perbedaan

# console
source: NEED TO OPTIMIZE
id: PERLU OPTIMASI

# console
source: Table "%s" need to be change
id: Tabel "%s" butuh diubah

# console
source: Column
id: Kolom

# console
source: type
id: tipe

# console
source: change from: [%s] to [%s]
id: ubah dari: [%s] ke [%s]

# console
source: default value
id: nilai bawaan

# console
source: scale
id: skala

# console
source: comment
id: komentar

# console
source: Added Column
id: Kolom Ditambahkan

# console
source: Removed Column
id: Kolom Yang Dihapus

# console
source: Renamed Column
id: Kolom Berganti Nama

# console
source: from [%s] to [%s]
id: dari [%s] ke [%s]

# console
source: Modify Index
id: Modifikasi Index

# console
source: from %s to %s
id: dari %s ke %s

# console
source: Added Index
id: Penambahan Index

# console
source: Removed Index
id: Penghapusan Index

# console
source: Renamed Index
id: Perubahan Nama Index

# console
source: Modify ForeignKey
id: Modifikasi ForeignKey

# console
source: Added ForeignKey
id: Penambahan ForeignKey

# console
source: Removed ForeignKey
id: Hapus ForeignKey

# console
source: Table "%s" for %s & does not exist in schema
id: Tabel "%s" untuk %s & tidak ada di skema

# console
source: Table "%s" for %s
id: Tabel "%s" untuk %s

# console
source: Contains changed database schema, you can execute command :
id: Berisi skema database yang diubah, anda dapat menjalankan perintah:

# console
source: Contains database table that can be optimized, you can execute command :
id: Berisi tabel database yang dapat dioptimasi, anda dapat menjalankan perintah :

# console
source: There are no tables that can be optimized
id: Tidak ada tabel yang dapat dioptimalkan

# console
source: %s does not yet support optimization
id: %s belum mendukung pengoptimalan

# console
source: Table "%s" can be freed up to : (%s)
id: Tabel "%s" dapat dikosongkan hingga : (%s)

# console
source: PLEASE DO NOT CANCEL OPERATION!
id: MOHON JANGAN MEMBATALKAN OPERASI!

# console
source: Optimizing table
id: Mengoptimasi tabel

# console
source: FAIL
id: GAGAL

# console
source: ALL DONE!
id: SEMUA SELESAI!

# console
source: Executed Command:
id: Perintah Tereksekusi:

# console
source: Executing:
id: Mengeksekusi:

# console
source: Failed to execute command
id: Gagal dalam mengeksekusi perintah

# console
source: Database connection error.
id: Koneksi basis data bermasalah.

# console
source: Database connection succeed
id: Koneksi basis data berhasil

# console
source: Database name
id: Nama basis data

# console
source: Database host
id: Host basis data

# console
source: Database user
id: Pengguna basis data

# console
source: Database password
id: Kata sandi basis data

# console
source: Unknown
id: Tidak diketahui

# console
source: Connection Object Info
id: Info Objek Koneksi

# console
source: Connection
id: Koneksi

# console
source: ORM Configuration
id: Konfigurasi ORM

# console
source: Query Cache
id: Cache Kueri

# console
source: Result Cache
id: Cache Hasil

# console
source: Proxy Namespace
id: Namespace Proksi

# console
source: Proxy Directory
id: Direktori Proksi

# console
source: Metadata Driver
id: Driver Metadata

# console
source: Repository Factory
id: Factory Repositori

# console
source: Quote Strategy
id: Strategi Quote

# console
source: Naming Factory
id: Factory Penamaan

# console
source: Schema Manager Factory
id: Factory Manajer Skema

# console
source: Not Set
id: Tidak Diatur

# console
source: Registered Schema / Entities
id: Skema / Entitas Yang Terdaftar

# console
source: Changing
id: Merubah

# console
source: Contains changed database schema, you can check with command :
id: Berisi skema database yang diubah, anda dapat memeriksanya dengan perintah :

# console
source: Generate database event class.
id: Hasilkan kelas event basis data.

# console
source: The %s help you to create %s object. Database Event will use prefix namespace with %s Database Event only support single class name.
id: %s membantu Anda membuat objek %s. Peristiwa Basis Data akan menggunakan awalan namespace dengan %s Basis Data Event hanya mendukung satu nama kelas.

# console
source: Please enter database event class name
id: Silakan masukkan nama kelas basis data event

# console
source: Please enter valid database event class name!
id: Silakan masukkan nama kelas basis data event yang sah!

# console
source: Event [%s] is invalid! class name contain reserved keyword!
id: Acara [%s] tidak valid! nama kelas berisi kata kunci bawaan!

# console
source: Event [%s] is invalid! Database event only contain single class name, not namespaced!
id: Event [%s] tidak sah! Basis data event hanya boleh berupa nama kelas tunggal, bukan bermuatan namespace!

# console
source: Database event [%s] is too long! Must be less or equal 128 characters
id: Event basis data [%s] terlalu panjang! Harus kurang dari atau sama dengan 128 karakter

# console
source: Database event [%s] exist
id: Database event [%s] tersedia

# console
source: %s Could not detect database event directory
id: %s Tidak dapat mendeteksi direktori basis data acara

# console
source: Database Event Name : %s
id: Nama Event Basis Data: %s

# console
source: DatabaseEvent Class : %s
id: Kelas DatabaseEvent : %s

# console
source: DatabaseEvent File : %s
id: Berkas DatabaseEvent : %s

# console
source: %s Could not save databaseEvent!
id: %s Tidak dapat menyimpan databaseEvent!

# console
source: %s DatabaseEvent successfully created!
id: %s DatabaseEvent berhasil dibuat!

# console
source: Generate entity class.
id: Hasilkan kelas entitas.

# console
source: The %s help you to create %s object. Entity will use prefix namespace with %s
id: %s membantu Anda membuat objek %s. Entitas akan menggunakan awalan namespace dengan %s

# console
source: Please enter entity name
id: Mohon masukkan nama entitas

# console
source: Please enter valid entity name!
id: Mohon masukkan nama entitas yang sah!

# console
source: Entity [%s] is invalid! class name contain reserved keyword!
id: Entitas [%s] tidak sah! nama kelas berisi kata kunci bawaan!

# console
source: Table name [%s] is too long! Must be less or equal 64 characters
id: Nama tabel [%s] terlalu panjang! Harus kurang dari atau sama dengan 64 karakter

# console
source: Entity [%s] exist
id: Entitas [%s] tersedia

# console
source: %s Could not detect entity directory
id: %s Tidak dapat mendeteksi direktori entitas

# console
source: Entity Name : %s
id: Nama Entitas : %s

# console
source: Table Name : %s
id: Nama Tabel : %s

# console
source: Entity Class : %s
id: Kelas Entitas : %s

# console
source: Entity File : %s
id: Berkas Entitas : %s

# console
source: %s Could not save entity!
id: %s Tidak dapat menyimpan entitas!

# console
source: %s Entity successfully created!
id: %s Entitas berhasil dibuat!

# console
source: Generate middleware class.
id: Hasilkan kelas middleware.

# console
source: The %s help you to create %s object. Middleware will use prefix namespace with %s
id: %s membantu Anda membuat objek %s. Middleware akan menggunakan awalan namespace dengan %s

# console
source: Please enter middleware class name
id: Mohon masukkan nama kelas middleware

# console
source: Please enter valid middleware class name!
id: Silakan masukkan nama kelas middleware yang sah!

# console
source: Middleware [%s] is invalid! Middleware only contain single class name, not namespaced!
id: Middleware [%s] tidak sah! middleware hanya boleh berupa nama kelas tunggal, bukan bermuatan namespace!

# console
source: Middleware [%s] is invalid! class name contain reserved keyword!
id: Middleware [%s] tidak sah! nama kelas berisi kata kunci bawaan!

# console
source: Middleware [%s] exist
id: Middleware [%s] tersedia

# console
source: %s Could not detect middleware directory
id: %s Tidak dapat mendeteksi direktori middleware

# console
source: Middleware Name : %s
id: Nama Middleware : %s

# console
source: Middleware Class : %s
id: Kelas Middleware: %s

# console
source: Middleware File : %s
id: Berkas Middleware : %s

# console
source: %s Could not save middleware!
id: %s Tidak dapat menyimpan middleware!

# console
source: %s Middleware successfully created!
id: %s Middleware berhasil dibuat!

# console
source: Generate module class.
id: Hasilkan kelas modul.

# console
source: The %s help you to create %s object. Module will use prefix namespace with %s Module only support single class name.
id: %s membantu Anda membuat objek %s. Modul akan menggunakan awalan namespace dengan %s Modul hanya mendukung nama kelas tunggal.

# console
source: Please enter module class name
id: Mohon masukkan nama kelas modul

# console
source: Please enter valid module class name!
id: Mohon masukkan nama kelas modul yang sah!

# console
source: Module [%s] is invalid! class name contain reserved keyword!
id: Modul [%s] tidak sah! nama kelas berisi kata kunci bawaan!

# console
source: Module [%s] is invalid! Module only contain single class name, not namespaced!
id: Modul [%s] tidak sah! Modul hanya boleh berupa nama kelas tunggal, bukan bermuatan namespace!

# console
source: Module [%s] is too long! Must be less or equal 128 characters
id: Modul [%s] terlalu panjang! Harus kurang dari atau sama dengan 128 karakter

# console
source: Module [%s] exist
id: Modul [%s] tersedia

# console
source: %s Could not detect module directory
id: %s Tidak dapat mendeteksi direktori modul

# console
source: Module Name : %s
id: Name Modul : %s

# console
source: Module Class : %s
id: Kelas Modul : %s

# console
source: Module Namespace : %s
id: Namespace Modul : %s

# console
source: Module File : %s
id: Berkas Modul : %s

# console
source: %s Could not save module!
id: %s Tidak dapat menyimpan modul!

# console
source: %s Module successfully created!
id: %s Modul berhasil dibuat!
